{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ebffebe3",
   "metadata": {},
   "outputs": [],
   "source": [
    "import rdflib\n",
    "from rdflib import Graph, Literal, RDF, RDFS, URIRef, Namespace\n",
    "from rdflib.namespace import FOAF, XSD\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import re \n",
    "import requests\n",
    "from bs4 import BeautifulSoup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "58c72090",
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "68fe115a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph g has 231 statements.\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix webSem: <http://www.semanticweb.org/marya/ontologies/2023/2/webSem#> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "\n",
      "<http://www.semanticweb.org/marya/ontologies/2023/2/webSem> a owl:Ontology .\n",
      "\n",
      "webSem:Actor a owl:Class ;\n",
      "    rdfs:subClassOf webSem:Person ;\n",
      "    owl:equivalentClass [ a owl:Class ;\n",
      "            owl:intersectionOf ( webSem:Person [ a owl:Restriction ;\n",
      "                        owl:onProperty webSem:isActorOf ;\n",
      "                        owl:someValuesFrom webSem:Movie ] ) ] .\n",
      "\n",
      "webSem:BTime2 a webSem:BroadcastTime,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:endDate \"2023-03-20T00:00:00\"^^xsd:dateTime ;\n",
      "    webSem:startDate \"2023-03-08T00:00:00\"^^xsd:dateTime .\n",
      "\n",
      "webSem:DanielCraig a webSem:Person,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:age \"55\"^^xsd:int ;\n",
      "    webSem:isActorOf webSem:CasinoRoyale ;\n",
      "    webSem:name \"Daniel Craig\" .\n",
      "\n",
      "webSem:Director a owl:Class ;\n",
      "    rdfs:subClassOf webSem:Person ;\n",
      "    owl:equivalentClass [ a owl:Class ;\n",
      "            owl:intersectionOf ( webSem:Person [ a owl:Restriction ;\n",
      "                        owl:onProperty webSem:isDirectorOf ;\n",
      "                        owl:someValuesFrom webSem:Movie ] ) ] .\n",
      "\n",
      "webSem:JohnTravolta a webSem:Person,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:age \"59\"^^xsd:int ;\n",
      "    webSem:isActorOf webSem:PulpFiction ;\n",
      "    webSem:name \"John Travolta\" ;\n",
      "    webSem:nationality \"American\" .\n",
      "\n",
      "webSem:MartinCampbell a webSem:Person,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:isDirectorOf webSem:CasinoRoyale ;\n",
      "    webSem:name \"Martin Campbell\" .\n",
      "\n",
      "webSem:NealPuvis a webSem:Person,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:isWriterOf webSem:CasinoRoyale ;\n",
      "    webSem:name \"Neal Puvis\" .\n",
      "\n",
      "webSem:QuentinTarantino a webSem:Person,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:age \"53\"^^xsd:int ;\n",
      "    webSem:isActorOf webSem:KillBill ;\n",
      "    webSem:isDirectorOf webSem:KillBill,\n",
      "        webSem:PulpFiction ;\n",
      "    webSem:isWriterOf webSem:KillBill,\n",
      "        webSem:PulpFiction ;\n",
      "    webSem:name \"Quentin Tarantino\" ;\n",
      "    webSem:nationality \"American\" .\n",
      "\n",
      "webSem:UmaThurman a webSem:Person,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:age \"43\"^^xsd:int ;\n",
      "    webSem:isActorOf webSem:PulpFiction ;\n",
      "    webSem:isWriterOf webSem:KillBill ;\n",
      "    webSem:name \"Uma Thurman\" .\n",
      "\n",
      "webSem:Writer a owl:Class ;\n",
      "    rdfs:subClassOf webSem:Person ;\n",
      "    owl:equivalentClass [ a owl:Class ;\n",
      "            owl:intersectionOf ( webSem:Person [ a owl:Restriction ;\n",
      "                        owl:onProperty webSem:isWriterOf ;\n",
      "                        owl:someValuesFrom webSem:Movie ] ) ] .\n",
      "\n",
      "webSem:age a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range xsd:int .\n",
      "\n",
      "webSem:boxOffice a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:country a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:endDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:BroadcastTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "webSem:gender a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range xsd:int .\n",
      "\n",
      "webSem:genre a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:hasBroadcastTimeOf a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Theater ;\n",
      "    rdfs:range webSem:BroadcastTime .\n",
      "\n",
      "webSem:imdbRating a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:float .\n",
      "\n",
      "webSem:imdbVotes a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:int .\n",
      "\n",
      "webSem:inTheDatesOf a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range webSem:BroadcastTime .\n",
      "\n",
      "webSem:isKnownFor a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range webSem:Movie .\n",
      "\n",
      "webSem:isProjectedAt a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range webSem:Theater ;\n",
      "    owl:inverseOf webSem:isProjecting .\n",
      "\n",
      "webSem:language a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:metacriticRating a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:float .\n",
      "\n",
      "webSem:name a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:nationality a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:overview a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:rated a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:releaseDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:dateTime,\n",
      "        xsd:string .\n",
      "\n",
      "webSem:rottenTomatoesRating a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:float .\n",
      "\n",
      "webSem:runtime a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:float .\n",
      "\n",
      "webSem:startDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:BroadcastTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "webSem:theaterName a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Theater ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:title a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:string .\n",
      "\n",
      "webSem:tmdbPopularity a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range xsd:float .\n",
      "\n",
      "webSem:tmdbVoteCount a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:int .\n",
      "\n",
      "webSem:year a owl:DatatypeProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range xsd:int .\n",
      "\n",
      "webSem:UGCLaDefense a webSem:Theater,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:hasBroadcastTimeOf webSem:BTime1 ;\n",
      "    webSem:theaterName \"UGC La Defense\" .\n",
      "\n",
      "webSem:UGCLesHalles a webSem:Theater,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:theaterName \"UGC Les Halles\" .\n",
      "\n",
      "webSem:isActorOf a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range webSem:Movie ;\n",
      "    owl:inverseOf webSem:isPlayedBy .\n",
      "\n",
      "webSem:isDirectorOf a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range webSem:Movie ;\n",
      "    owl:inverseOf webSem:wasDirectedBy .\n",
      "\n",
      "webSem:isPlayedBy a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range webSem:Person .\n",
      "\n",
      "webSem:isProjecting a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Theater ;\n",
      "    rdfs:range webSem:Movie .\n",
      "\n",
      "webSem:isWriterOf a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Person ;\n",
      "    rdfs:range webSem:Movie ;\n",
      "    owl:inverseOf webSem:wasWrittenBy .\n",
      "\n",
      "webSem:wasDirectedBy a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range webSem:Person .\n",
      "\n",
      "webSem:wasWrittenBy a owl:ObjectProperty ;\n",
      "    rdfs:domain webSem:Movie ;\n",
      "    rdfs:range webSem:Person .\n",
      "\n",
      "webSem:BTime1 a webSem:BroadcastTime,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:endDate \"2023-03-10T00:00:00\"^^xsd:dateTime ;\n",
      "    webSem:startDate \"2023-03-01T00:00:00\"^^xsd:dateTime .\n",
      "\n",
      "webSem:CasinoRoyale a webSem:Movie,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:country \"UK\" ;\n",
      "    webSem:genre \"Action\",\n",
      "        \"Adventure\"^^xsd:string,\n",
      "        \"Thriller\"^^xsd:string ;\n",
      "    webSem:inTheDatesOf webSem:BTime1 ;\n",
      "    webSem:isProjectedAt webSem:UGCLesHalles ;\n",
      "    webSem:language \"English\" ;\n",
      "    webSem:title \"Casino Royale\" ;\n",
      "    webSem:year \"2006\"^^xsd:int .\n",
      "\n",
      "webSem:KillBill a webSem:Movie,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:country \"USA\" ;\n",
      "    webSem:genre \"Action\",\n",
      "        \"Crime\"^^xsd:string,\n",
      "        \"Thriller\"^^xsd:string ;\n",
      "    webSem:language \"English\" ;\n",
      "    webSem:title \"Kill Bill\" ;\n",
      "    webSem:year \"2003\"^^xsd:int .\n",
      "\n",
      "webSem:PulpFiction a webSem:Movie,\n",
      "        owl:NamedIndividual ;\n",
      "    webSem:country \"USA\" ;\n",
      "    webSem:genre \"Crime\",\n",
      "        \"Thriller\"^^xsd:string ;\n",
      "    webSem:isProjectedAt webSem:UGCLaDefense ;\n",
      "    webSem:language \"English\" ;\n",
      "    webSem:title \"Pulp Fiction\" ;\n",
      "    webSem:year \"1994\"^^xsd:int .\n",
      "\n",
      "webSem:BroadcastTime a owl:Class ;\n",
      "    owl:disjointWith webSem:Person .\n",
      "\n",
      "webSem:Theater a owl:Class .\n",
      "\n",
      "webSem:Person a owl:Class ;\n",
      "    owl:disjointWith webSem:Theater .\n",
      "\n",
      "webSem:Movie a owl:Class ;\n",
      "    owl:disjointWith webSem:Person,\n",
      "        webSem:Theater .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#Defining the namespace\n",
    "nspace = Namespace(\"Project.rdf\")\n",
    "\n",
    "# Create a Graph\n",
    "g = Graph()\n",
    "\n",
    "# Parse in an RDF file hosted locally\n",
    "g.parse(\"Project2.rdf\")\n",
    "\n",
    "g.namespace_manager.bind(\"nl\",nspace)\n",
    "\n",
    "# Loop through each triple in the graph (subj, pred, obj)\n",
    "for subj, pred, obj in g:\n",
    "    # Check if there is at least one triple in the Graph\n",
    "    if (subj, pred, obj) not in g:\n",
    "       raise Exception(\"It better be!\")\n",
    "\n",
    "# Print the number of \"triples\" in the Graph\n",
    "print(f\"Graph g has {len(g)} statements.\")\n",
    "\n",
    "# Print out the entire Graph in the RDF Turtle format\n",
    "print(g.serialize(format=\"n3\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "cf1686f8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Casino Royale\n",
      "Kill Bill\n",
      "Pulp Fiction\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\"\"\"\n",
    "                SELECT ?title\n",
    "                    WHERE { ?x rdf:type webSem:Movie;\n",
    "                               webSem:title ?title }\n",
    "                \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(f\"{row.title}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ab322b7b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Casino Royale, 2006\n",
      "Kill Bill, 2003\n",
      "Pulp Fiction, 1994\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\"\"\"\n",
    "                SELECT ?title ?year\n",
    "                    WHERE { ?x rdf:type webSem:Movie.\n",
    "                            ?x webSem:title ?title.\n",
    "                            ?x webSem:year ?year\n",
    "                               }\n",
    "                \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(f\"{row.title}, {row.year}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "9f8116bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "John Travolta, 59, Pulp Fiction, Crime Thriller\n",
      "Uma Thurman, 43, Pulp Fiction, Crime Thriller\n",
      "Quentin Tarantino, 53, Kill Bill, Action Crime Thriller\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\"\"\"\n",
    "                SELECT DISTINCT ?name ?age ?title ?genre\n",
    "                    WHERE { ?x webSem:isActorOf ?movie.\n",
    "                            ?movie webSem:title ?title.\n",
    "                            ?movie webSem:genre ?genre.\n",
    "                            ?x webSem:name ?name.\n",
    "                            ?x webSem:age ?age\n",
    "                            FILTER regex(?genre, \"Crime\")\n",
    "                               }\n",
    "                \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(f\"{row.name}, {row.age}, {row.title}, {row.genre}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "7f26d332",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Quentin Tarantino, 53\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\"\"\"\n",
    "                SELECT DISTINCT ?name ?age\n",
    "                    WHERE { ?x webSem:isDirectorOf ?isDirectorOf.\n",
    "                            ?x webSem:name ?name.\n",
    "                            ?x webSem:age ?age\n",
    "                               }\n",
    "                \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(f\"{row.name}, {row.age}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4336e80c",
   "metadata": {},
   "outputs": [],
   "source": [
    "qres = g.query(\"\"\"\n",
    "                SELECT DISTINCT ?name ?age\n",
    "                    WHERE { ?x webSem:isDirectorOf ?isDirectorOf.\n",
    "                            ?x webSem:name ?name.\n",
    "                            ?x webSem:age ?age\n",
    "                               }\n",
    "                \"\"\")\n",
    "\n",
    "for row in qres:\n",
    "    print(f\"{row.name}, {row.age}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "7fa2f3ea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<rdflib.plugins.sparql.processor.SPARQLResult object at 0x000001DE927BA190>\n",
      "Kill Bill Crime\n"
     ]
    }
   ],
   "source": [
    "qres = g.query(\"\"\"\n",
    "                SELECT  ?title ?genre\n",
    "                    WHERE { ?x webSem:title ?title.\n",
    "                            ?x webSem:genre ?genre\n",
    "                            FILTER (?title=\"Kill Bill\")\n",
    "                               }\n",
    "                \"\"\")\n",
    "\n",
    "print(qres)\n",
    "title = \"\"\n",
    "genre = \"\"\n",
    "for row in qres:\n",
    "    title = row.title\n",
    "    genre  row.genre + \" \"\n",
    "\n",
    "print(f\"{row.title} {row.genre}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "671b22ea",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
